// Цикл for
// for(ініціалізація,умова,пост - вираз){
// тіло циклу
// }
// =====================================
// for (let i = 0; i < 5; i += 1 ) {
//     console.log(i);
// }
// console.log('ibonite');
// ==========================
// Напиши скрипт який підраховує спільну суму зарплат працівників
// Кіл-ть парцівників зберігаються в змінній employes
// Кожна зп робочих це випадкове число від 500 до 5000
// Записати суму змінну totalSelary і вивести в консоль

// створити змінні (вари)
const employees = 4;
const totalSalary = 0;
const minSalary = 500;
const maxSalary = 5000;
// перебрати всіх робочих
// згенерувати випадкову зп
// додати до тоталу
// вивестив консоль
for (let i = 0; i < 4; i += 1) {
    console.log(i)
}
console.log(totalSalary);
