// Написати скріпт який визначає ціну готельного номера за кількістю зірок :
// 1= 20;
// 2 = 30;
// 3 = 50;
// 4 = 70;
// 5 = 120;
// Якщо в перемінній  stars щось окрім цифр 1-5,то виведи строку
// "такої кількості зірок не має"
// const stars = 3;
// let price;

// if (stars === 1){
//     price = 20;
// } else if (stars === 2) {
//     price = 30;
// } else if (stars === 3) {
//     price = 50;
// } else if (stars === 4) {
//     price = 70;
// } else if (stars === 5) {
//     price = 120;
// } else {
//     console.log('такої кількості зірок не має');
// }
// console.log(price);

// =================
// switch (stars) {
//     case 1:
//         price = 20;
//         break;
    
//     case 2:
//         price = 30;
//         break;
    
//     case 3:
//         price = 50;
//         break;
    
//     case 4:
//         price = 70;
//         break;
//     case 5:
//         price = 120;
//         break;
//     default:
//         console.log('такої кількості зірок не має');
// }

// console.log('ціна готелю', price);

// =======================
// написати скріпт вибору отелю за кіль-стю зірок
// 1,2 = 20;
// 3,4 = 50;
// 5 ==120;

// const stars = 3;
// let price;

// if (stars === 1 || stars ===2){
//     price = 20;

// } else if (stars === 3 || stars === 4) {
//     price = 50;

// } else if (stars === 5) {
//     price = 120;
// } else {
//     console.log('такої кількості зірок не має');
// }
// console.log(price);



// =========================

// switch (stars) {
//     case 1:
//     case 2:
//         price = 20;
//         break;
//     case 3:
//     case 4:
//         price = 50;
//         break;
//     case 5:
//         price = 120;
//         break;
//     default:
//         console.log('такої кількості зірок не має');
// }
//           console.log(price);

// =================================
//  ЗАДАЧА !!!

// нАПИШИ СКРИПТ вибору опції доставки товару
//Опція зберігаються в змінній options: 1-самовивіз; 2-курьєр; 3-пошта

// В змінну message записати повідомлення в залежності від:
// -Ви зможете забрати завтра ваш товар в 12:00 в нас в офісі
// -КУрьєр доставить завтра товар з 9:00 до 18:00
// -Посилка буде відправлена сьогодні
// - Вам передзвонить менеджер
// ============================================
//  алгоритм розв'язання задачі

// 1) записати змінні
// const option = 7;
// let message = '' ;

// 2) створити swith
// 3) в кожен кейс записати в message строку
// switch (option) {
//     case 1:
//         message ='Ви зможете забрати завтра ваш товар в 12:00 в нас в офісі'
//         break;
//     case 2:
//         message = 'КУрьєр доставить завтра товар з 9:00 до 18:00'
//         break;
//     case 3:
//         message = 'Посилка буде відправлена сьогодні'
//         break;
//     default:
//         message = ('Вам передзвонить менеджер');}


// зробит лог(console.log) message
// console.log(message);
// ===========================================

