// Напиши скрипт обробки покупок в магазині
// баланс користувача знаходиться в змінній balance
// Сума покупок знаходиться в змінній payment
// Перед перевіркою вивевсти повімлення:<<Спільна сума заказу [число] кредитів.Перевіряємо кіль-ть грошей на рахунку>>
// Якщо сума покупки не перевищує баланс
// -Вирахувати суму покупки з рахунку
// -Вивести повідомлення:<<На рахунку залишилося [число] кредитів>>
// Якщо сума перевищує баланс
// -Вивести по-ння <<На рахунку не достатньо грошей для проведення операції>>
// В кінці вивести повід-ння: <<Операція завершена>>

// =====================================
// 1 вари
let balance = 10000;
const payment = 2000;



//<<Все добре,знімаємо кошти ...Дякую за покупку>>













